package by.htp.cycles.logic;

public class Task04 {
public static void task() {
	//С помощью оператора while напишите программу вывода всех четных
	//чисел в диапазоне от 2 до 100 включительно.
	
	int x = 0;
	
	while(x<100) {
		x = x+2;
		
		 System.out.print(x+ " ");
		
		
	}
		
}
}
